## Mysql

In [1]:
import mysql.connector

In [2]:
con = mysql.connector.connect(host="localhost", user="root", passwd="Microsoft@9623")
print(con)

<mysql.connector.connection.MySQLConnection object at 0x000001E44C84E190>

In [3]:
mycursor = con.cursor()

In [4]:
mycursor.execute("SHOW DATABASES")

for db in mycursor:
    print(db)

('doctor',)
('information_schema',)
('mydatabase',)
('mysql',)
('performance_schema',)
('sakila',)
('student_dbm',)
('sys',)
('world',)

In [5]:
mycursor.execute("CREATE DATABASE Employee_DB")

In [6]:
mycursor.execute("SHOW DATABASES")

for db in mycursor:
    print(db)

('doctor',)
('employee_db',)
('information_schema',)
('mydatabase',)
('mysql',)
('performance_schema',)
('sakila',)
('student_dbm',)
('sys',)
('world',)

In [7]:
con = mysql.connector.connect(host="localhost", user="root", passwd="Microsoft@9623", database="employee_db")
print(con)

<mysql.connector.connection.MySQLConnection object at 0x000001E44DDB1820>

In [8]:
dbase = con.cursor()

### Create an Employee Table with employee name,employee ID & Salary

In [11]:
dbase.execute("CREATE TABLE Employee (EmployeeId VARCHAR(10), EmployeeName VARCHAR(20), EmployeeSalary INT(10))")

In [12]:
dbase.execute("SHOW TABLES")

for table in dbase:
    print(table)

('employee',)

In [13]:
sql = "INSERT INTO Employee (EmployeeId, EmployeeName, EmployeeSalary) VALUES (%s,%s,%s)"
values = [
    ('1', 'Walter White', '40000'),
    ('2', 'Jesse Pinkman', '35000'),
    ('3', 'Arthur Shelby', '37000'),
    ('4', 'Ross Geller', '30000'),
    ('5', 'Denver', '42000'),
    ('6', 'Berlin', '45000'),
    ('7', 'Harry', '50000'),
    ('8', 'Ellis Carver', '52000'),
    ('9', 'Omar Little', '60000'),
    ('10', 'Jimmy McNulty', '55000')
]

In [14]:
dbase.executemany(sql,values)
con.commit()
print(f"{dbase.rowcount} record inserted")

10 record inserted

In [19]:
dbase.execute("SELECT * FROM employee")

In [20]:
mydatabase = dbase.fetchall()
for data in mydatabase:
    print(data)

('1', 'Walter White', 40000)
('2', 'Jesse Pinkman', 35000)
('3', 'Arthur Shelby', 37000)
('4', 'Ross Geller', 30000)
('5', 'Denver', 42000)
('6', 'Berlin', 45000)
('7', 'Harry', 50000)
('8', 'Ellis Carver', 52000)
('9', 'Omar Little', 60000)
('10', 'Jimmy McNulty', 55000)

### Write a query to get the maximum and minimum salary from employees table

In [47]:
dbase.execute("SELECT MIN(EmployeeSalary) AS MinimumSalary FROM employee")

In [48]:
minimum = dbase.fetchone()
print(f"Minimum Salary Rs.{minimum[0]}")

Minimum Salary Rs.30000

In [49]:
dbase.execute("SELECT MAX(EmployeeSalary) AS MaximumSalary FROM employee")

In [50]:
maximum = dbase.fetchone()
print(f"Maximum Salary Rs.{maximum[0]}")

Maximum Salary Rs.60000

### Write a query to get the number of employees working with the company

In [51]:
dbase.execute("SELECT COUNT(EmployeeId) FROM Employee")

In [52]:
count = dbase.fetchone()
print(f"Total number of employees working: {count[0]}")

Total number of employees working: 10

### Write a query to get the first 3 characters of first name from employees table

In [55]:
dbase.execute("SELECT SUBSTRING(EmployeeName,1,3) FROM Employee")

In [56]:
names = dbase.fetchall()

for name in names:
    print(name[0])

Wal
Jes
Art
Ros
Den
Ber
Har
Ell
Oma
Jim

In [57]:
con.close()